:PROPERTIES:
:ID: 4e1b0644-98de-480c-a63b-92e0a5153957
:END:
#+title: History
#+description: History
#+type: recipe
#+version: 2
#+level: cross
#+filetags: :recipe:shell:change_reason_categories:
#+created: 2026-05-21
#+updated: 2026-05-21

Get version history for a change reason category.

#+name: change-reason-categories-history
#+begin_src ores-shell :exports none
change-reason-categories history system
exit
#+end_src

#+begin_src sh :noweb yes :results output  :wrap example
export ORES_SHELL_LOGIN_PASSWORD
./ores.shell ${log_args} ${connect_args} ${login_args} << 'EOF'
<<change-reason-categories-history>>
EOF
#+end_src

#+RESULTS:
#+begin_example
✓ Connected to :51004
✓ Logged in as: newuser3
ORE Studio Shell REPL v0.0.8
Type 'help' for available commands, 'exit' to quit.

ores-shell>
+--------+-------------------------------------------------------------------------+-------------+---------+
| Code   | Description                                                             | Recorded By | Version |
+--------+-------------------------------------------------------------------------+-------------+---------+
| system | System-generated reasons for automatic operations (not user-selectable) | system      | 1       |
+--------+-------------------------------------------------------------------------+-------------+---------+


ores-shell> Bye!
#+end_example
